
## Plan Result (aws/main)

[CI link](https://github.com/grimoh/infrastructure/actions/runs/5186297854)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_kms_alias.tf_confidential


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_kms_alias.tf_confidential will be created
  + resource "aws_kms_alias" "tf_confidential" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/aws-main-tf-confidential"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "80806601-e5ae-4304-a71e-4c79ee7473dd"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":195,"Program":"tfcmt","SHA1":"e8e6e52538623129c0c1248d1bf49763fbfb7cf4","Target":"aws/main","Vars":{},"WorkflowName":"test"} -->